CREATE TABLE Produce (
    name VARCHAR(255),
    type VARCHAR(10),
    color VARCHAR(20),
    calories INTEGER
);

INSERT INTO Produce (name, type, color, calories) VALUES
('Яблоко', 'Фрукт', 'Красный', 47),
('Яблоко', 'Фрукт', 'Зеленый', 45),
('Морковь', 'Овощ', 'Оранжевый', 35),
('Банан', 'Фрукт', 'Желтый', 96),
('Базилик', 'Овощ', 'Фиолетовый', 22),
('Капуста', 'Овощ', 'Зеленый', 27),
('Клубника', 'Фрукт', 'Красный', 33),
('Редис', 'Овощ', 'Красный', 19),
('Киви', 'Фрукт', 'Зеленый', 61),
('Вишня', 'Фрукт', 'Вишневый', 52),
('Огурец', 'Овощ', 'Зеленый', 61),
('Помидор', 'Фрукт', 'Красный', 18),
('Апельсин', 'Фрукт', 'Оранжевый', 47);
